The selected fixture is part of a system with different classification. System calculations (e.g. flow analysis) are not possible between systems with different classifications.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MismatchedSystemClassificationHasSystemWarning { get; }
  Visual Basic
Public Shared ReadOnly Property MismatchedSystemClassificationHasSystemWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MismatchedSystemClassificationHasSystemWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace